Installed pandas and numpy labraries to modify the dataset.

In [49]:
import pandas as pd
import numpy as np

Cleaning Data

1. Column 2: change datetime to time (HH:MM).
2. Column 4: change empty places to display "payed with cash".
3. Column 5: change Amount of money in Ukrainian hryvnias to Euros.
4. Count missing values for each column.
5. Rename columns with proper names

Get the data.

In [50]:
data = pd.read_csv('coffee_sales.csv')
data.head()

,date,datetime,cash_type,card,money,coffee_name
0,2024-03-01,2024-03-01 10:15:50.520,card,ANON-0000-0000-0001,38.7,Latte
1,2024-03-01,2024-03-01 12:19:22.539,card,ANON-0000-0000-0002,38.7,Hot Chocolate
2,2024-03-01,2024-03-01 12:20:18.089,card,ANON-0000-0000-0002,38.7,Hot Chocolate
3,2024-03-01,2024-03-01 13:46:33.006,card,ANON-0000-0000-0003,28.9,Americano
4,2024-03-01,2024-03-01 13:48:14.626,card,ANON-0000-0000-0004,38.7,Latte

#### 1. Formating columns Date and Datetime

In [51]:
from datetime import datetime

data["date"] = pd.to_datetime(data["date"], format="%Y-%m-%d")

data["datetime"] = pd.to_datetime(data["datetime"]).dt.strftime('%H:%M:%S')

print(data.dtypes)

date           datetime64[ns]
datetime               object
cash_type              object
card                   object
money                 float64
coffee_name            object
dtype: object

#### 2. Formating Column 4
- Counting missing values for all column
- Replace empty spaces with "payed with cash"
- Check the result

In [52]:
print(data.isna().sum())

date            0
datetime        0
cash_type       0
card           89
money           0
coffee_name     0
dtype: int64

In [53]:
data = data.astype(str)

data.replace(["nan"], "payed with cash", inplace=True)

print(data.isna().sum())
print(data.iloc[12])

date           0
datetime       0
cash_type      0
card           0
money          0
coffee_name    0
dtype: int64
date                2024-03-02
datetime              10:30:35
cash_type                 cash
card           payed with cash
money                     40.0
coffee_name              Latte
Name: 12, dtype: object

#### 3. Formating Column 5
- Check the value type
- Fix the values type
- Fix currency from ukrainian hryvnas to euro

In [54]:
data['money'].apply(type).value_counts()

money
<class 'str'>    3636
Name: count, dtype: int64

In [56]:
data['money'] = data['money'].astype(float)
data['money'].apply(type).value_counts()

money
<class 'float'>    3636
Name: count, dtype: int64

In [57]:
data['money'] = (data['money'] / 48.7).round(2)
data.head()

         date  datetime cash_type                 card  money    coffee_name
0  2024-03-01  10:15:50      card  ANON-0000-0000-0001   0.79          Latte
1  2024-03-01  12:19:22      card  ANON-0000-0000-0002   0.79  Hot Chocolate
2  2024-03-01  12:20:18      card  ANON-0000-0000-0002   0.79  Hot Chocolate
3  2024-03-01  13:46:33      card  ANON-0000-0000-0003   0.59      Americano
4  2024-03-01  13:48:14      card  ANON-0000-0000-0004   0.79          Latte

#### 4. Renaming columns

In [58]:
new_column_names = {"date": "date", 
                    "datetime": "time", 
                    "cash_type": "payment_type", 
                    "card": "card", 
                    "money": "amount_eur", 
                    "coffee_name": "coffee_type"}

data.rename(columns=new_column_names, inplace=True)
print(data.columns)

Index(['date', 'time', 'payment_type', 'card', 'amount_eur', 'coffee_type'], dtype='object')

Save formated file

In [59]:
data.to_csv('coffee_sales_updated.csv', index=False)

The coffee_sales.csv file was successfully formated and saved in the project. The file ready to be uploaded to a database.